{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 96, 96, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": false, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block1_conv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1_conv1_act"}, "inbound_nodes": [[["block1_conv1_bn", 0, 0]]], "name": "block1_conv1_act"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["block1_conv1_act", 0, 0]]], "name": "block1_conv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block1_conv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_conv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block1_conv2_act"}, "inbound_nodes": [[["block1_conv2_bn", 0, 0]]], "name": "block1_conv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block2_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block1_conv2_act", 0, 0]]], "name": "block2_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block2_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block2_sepconv1", 0, 0]]], "name": "block2_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block2_sepconv2_act"}, "inbound_nodes": [[["block2_sepconv1_bn", 0, 0]]], "name": "block2_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block2_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block2_sepconv2_act", 0, 0]]], "name": "block2_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block2_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block2_sepconv2", 0, 0]]], "name": "block2_sepconv2_bn"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": false, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["block1_conv2_act", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["block2_sepconv2_bn", 0, 0]]], "name": "block2_pool"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block2_pool", 0, 0], ["batchnormalization_1", 0, 0]]], "name": "merge_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3_sepconv1_act"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "block3_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block3_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block3_sepconv1_act", 0, 0]]], "name": "block3_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block3_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block3_sepconv1", 0, 0]]], "name": "block3_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block3_sepconv2_act"}, "inbound_nodes": [[["block3_sepconv1_bn", 0, 0]]], "name": "block3_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block3_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block3_sepconv2_act", 0, 0]]], "name": "block3_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block3_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block3_sepconv2", 0, 0]]], "name": "block3_sepconv2_bn"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": false, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["block3_sepconv2_bn", 0, 0]]], "name": "block3_pool"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block3_pool", 0, 0], ["batchnormalization_2", 0, 0]]], "name": "merge_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block4_sepconv1_act"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "block4_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block4_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block4_sepconv1_act", 0, 0]]], "name": "block4_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block4_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block4_sepconv1", 0, 0]]], "name": "block4_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block4_sepconv2_act"}, "inbound_nodes": [[["block4_sepconv1_bn", 0, 0]]], "name": "block4_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block4_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block4_sepconv2_act", 0, 0]]], "name": "block4_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block4_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block4_sepconv2", 0, 0]]], "name": "block4_sepconv2_bn"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["block4_sepconv2_bn", 0, 0]]], "name": "block4_pool"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block4_pool", 0, 0], ["batchnormalization_3", 0, 0]]], "name": "merge_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block5_sepconv1_act"}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "block5_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block5_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block5_sepconv1_act", 0, 0]]], "name": "block5_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block5_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block5_sepconv1", 0, 0]]], "name": "block5_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block5_sepconv2_act"}, "inbound_nodes": [[["block5_sepconv1_bn", 0, 0]]], "name": "block5_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block5_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block5_sepconv2_act", 0, 0]]], "name": "block5_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block5_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block5_sepconv2", 0, 0]]], "name": "block5_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block5_sepconv3_act"}, "inbound_nodes": [[["block5_sepconv2_bn", 0, 0]]], "name": "block5_sepconv3_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block5_sepconv3", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block5_sepconv3_act", 0, 0]]], "name": "block5_sepconv3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block5_sepconv3_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block5_sepconv3", 0, 0]]], "name": "block5_sepconv3_bn"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block5_sepconv3_bn", 0, 0], ["merge_3", 0, 0]]], "name": "merge_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block6_sepconv1_act"}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "block6_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block6_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block6_sepconv1_act", 0, 0]]], "name": "block6_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block6_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block6_sepconv1", 0, 0]]], "name": "block6_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block6_sepconv2_act"}, "inbound_nodes": [[["block6_sepconv1_bn", 0, 0]]], "name": "block6_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block6_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block6_sepconv2_act", 0, 0]]], "name": "block6_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block6_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block6_sepconv2", 0, 0]]], "name": "block6_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block6_sepconv3_act"}, "inbound_nodes": [[["block6_sepconv2_bn", 0, 0]]], "name": "block6_sepconv3_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block6_sepconv3", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block6_sepconv3_act", 0, 0]]], "name": "block6_sepconv3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block6_sepconv3_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block6_sepconv3", 0, 0]]], "name": "block6_sepconv3_bn"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block6_sepconv3_bn", 0, 0], ["merge_4", 0, 0]]], "name": "merge_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block7_sepconv1_act"}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "block7_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block7_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block7_sepconv1_act", 0, 0]]], "name": "block7_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block7_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block7_sepconv1", 0, 0]]], "name": "block7_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block7_sepconv2_act"}, "inbound_nodes": [[["block7_sepconv1_bn", 0, 0]]], "name": "block7_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block7_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block7_sepconv2_act", 0, 0]]], "name": "block7_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block7_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block7_sepconv2", 0, 0]]], "name": "block7_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block7_sepconv3_act"}, "inbound_nodes": [[["block7_sepconv2_bn", 0, 0]]], "name": "block7_sepconv3_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block7_sepconv3", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block7_sepconv3_act", 0, 0]]], "name": "block7_sepconv3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block7_sepconv3_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block7_sepconv3", 0, 0]]], "name": "block7_sepconv3_bn"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block7_sepconv3_bn", 0, 0], ["merge_5", 0, 0]]], "name": "merge_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block8_sepconv1_act"}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "block8_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block8_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block8_sepconv1_act", 0, 0]]], "name": "block8_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block8_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block8_sepconv1", 0, 0]]], "name": "block8_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block8_sepconv2_act"}, "inbound_nodes": [[["block8_sepconv1_bn", 0, 0]]], "name": "block8_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block8_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block8_sepconv2_act", 0, 0]]], "name": "block8_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block8_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block8_sepconv2", 0, 0]]], "name": "block8_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block8_sepconv3_act"}, "inbound_nodes": [[["block8_sepconv2_bn", 0, 0]]], "name": "block8_sepconv3_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block8_sepconv3", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block8_sepconv3_act", 0, 0]]], "name": "block8_sepconv3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block8_sepconv3_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block8_sepconv3", 0, 0]]], "name": "block8_sepconv3_bn"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block8_sepconv3_bn", 0, 0], ["merge_6", 0, 0]]], "name": "merge_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block9_sepconv1_act"}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "block9_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block9_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block9_sepconv1_act", 0, 0]]], "name": "block9_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block9_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block9_sepconv1", 0, 0]]], "name": "block9_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block9_sepconv2_act"}, "inbound_nodes": [[["block9_sepconv1_bn", 0, 0]]], "name": "block9_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block9_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block9_sepconv2_act", 0, 0]]], "name": "block9_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block9_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block9_sepconv2", 0, 0]]], "name": "block9_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block9_sepconv3_act"}, "inbound_nodes": [[["block9_sepconv2_bn", 0, 0]]], "name": "block9_sepconv3_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block9_sepconv3", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block9_sepconv3_act", 0, 0]]], "name": "block9_sepconv3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block9_sepconv3_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block9_sepconv3", 0, 0]]], "name": "block9_sepconv3_bn"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block9_sepconv3_bn", 0, 0], ["merge_7", 0, 0]]], "name": "merge_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block10_sepconv1_act"}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "block10_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block10_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block10_sepconv1_act", 0, 0]]], "name": "block10_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block10_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block10_sepconv1", 0, 0]]], "name": "block10_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block10_sepconv2_act"}, "inbound_nodes": [[["block10_sepconv1_bn", 0, 0]]], "name": "block10_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block10_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block10_sepconv2_act", 0, 0]]], "name": "block10_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block10_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block10_sepconv2", 0, 0]]], "name": "block10_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block10_sepconv3_act"}, "inbound_nodes": [[["block10_sepconv2_bn", 0, 0]]], "name": "block10_sepconv3_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block10_sepconv3", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block10_sepconv3_act", 0, 0]]], "name": "block10_sepconv3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block10_sepconv3_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block10_sepconv3", 0, 0]]], "name": "block10_sepconv3_bn"}, {"class_name": "Merge", "config": {"name": "merge_9", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block10_sepconv3_bn", 0, 0], ["merge_8", 0, 0]]], "name": "merge_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block11_sepconv1_act"}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "block11_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block11_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block11_sepconv1_act", 0, 0]]], "name": "block11_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block11_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block11_sepconv1", 0, 0]]], "name": "block11_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block11_sepconv2_act"}, "inbound_nodes": [[["block11_sepconv1_bn", 0, 0]]], "name": "block11_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block11_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block11_sepconv2_act", 0, 0]]], "name": "block11_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block11_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block11_sepconv2", 0, 0]]], "name": "block11_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block11_sepconv3_act"}, "inbound_nodes": [[["block11_sepconv2_bn", 0, 0]]], "name": "block11_sepconv3_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block11_sepconv3", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block11_sepconv3_act", 0, 0]]], "name": "block11_sepconv3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block11_sepconv3_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block11_sepconv3", 0, 0]]], "name": "block11_sepconv3_bn"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block11_sepconv3_bn", 0, 0], ["merge_9", 0, 0]]], "name": "merge_10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block12_sepconv1_act"}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "block12_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block12_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block12_sepconv1_act", 0, 0]]], "name": "block12_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block12_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block12_sepconv1", 0, 0]]], "name": "block12_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block12_sepconv2_act"}, "inbound_nodes": [[["block12_sepconv1_bn", 0, 0]]], "name": "block12_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block12_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block12_sepconv2_act", 0, 0]]], "name": "block12_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block12_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block12_sepconv2", 0, 0]]], "name": "block12_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block12_sepconv3_act"}, "inbound_nodes": [[["block12_sepconv2_bn", 0, 0]]], "name": "block12_sepconv3_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block12_sepconv3", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block12_sepconv3_act", 0, 0]]], "name": "block12_sepconv3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block12_sepconv3_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block12_sepconv3", 0, 0]]], "name": "block12_sepconv3_bn"}, {"class_name": "Merge", "config": {"name": "merge_11", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block12_sepconv3_bn", 0, 0], ["merge_10", 0, 0]]], "name": "merge_11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block13_sepconv1_act"}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "block13_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block13_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 728, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block13_sepconv1_act", 0, 0]]], "name": "block13_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block13_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block13_sepconv1", 0, 0]]], "name": "block13_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block13_sepconv2_act"}, "inbound_nodes": [[["block13_sepconv1_bn", 0, 0]]], "name": "block13_sepconv2_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block13_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 1024, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block13_sepconv2_act", 0, 0]]], "name": "block13_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block13_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block13_sepconv2", 0, 0]]], "name": "block13_sepconv2_bn"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": false, "nb_filter": 1024, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "MaxPooling2D", "config": {"name": "block13_pool", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "same"}, "inbound_nodes": [[["block13_sepconv2_bn", 0, 0]]], "name": "block13_pool"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "Merge", "config": {"name": "merge_12", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["block13_pool", 0, 0], ["batchnormalization_4", 0, 0]]], "name": "merge_12"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block14_sepconv1", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 1536, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["merge_12", 0, 0]]], "name": "block14_sepconv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block14_sepconv1_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block14_sepconv1", 0, 0]]], "name": "block14_sepconv1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block14_sepconv1_act"}, "inbound_nodes": [[["block14_sepconv1_bn", 0, 0]]], "name": "block14_sepconv1_act"}, {"class_name": "SeparableConvolution2D", "config": {"depth_multiplier": 1, "b_constraint": null, "name": "block14_sepconv2", "activation": "linear", "trainable": true, "pointwise_constraint": null, "nb_col": 3, "pointwise_regularizer": null, "dim_ordering": "tf", "depthwise_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": false, "nb_filter": 2048, "border_mode": "same", "b_regularizer": null, "depthwise_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["block14_sepconv1_act", 0, 0]]], "name": "block14_sepconv2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "block14_sepconv2_bn", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["block14_sepconv2", 0, 0]]], "name": "block14_sepconv2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "block14_sepconv2_act"}, "inbound_nodes": [[["block14_sepconv2_bn", 0, 0]]], "name": "block14_sepconv2_act"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "tf"}, "inbound_nodes": [[["block14_sepconv2_act", 0, 0]]], "name": "globalaveragepooling2d_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "bbox", "output_dim": 4, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 2048, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 2048]}, "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "name": "bbox"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["bbox", 0, 0]], "name": "model_1"}}